'''
# //杨辉三角规律                                    行号    第一个偶数在该行第几个
# //                    1                           1             -1
# //                1   1   1                       2             -1
# //            1   2   3   2   1                   3              2
# //         1  3   6   7   6   3   1               4              3
# //      1  4  10  16  19  16  10  4  1            5              2
# //   1  5  15 30  45  51  45  30  15 5  1         6              4
# // 1  6  21                                       7              2
#   1 7  28                                         8              3
# //  首个偶数在该行第几个的规律： -1 -1 （2 3 2 4）···（2 3 2 4）
#穷举出所求行的数字，判断所求行偶数的位置

'''

while True:
	try:
		arr = [2, 3, 2, 4]
		n = int(input().strip())
		if n < 3:
			print(-1)
		else:
			num = (n - 3) % 4
			print(arr[num])
	except:
		break
